
Feature: Създаване на коментар

	Scenario: Създаване на коментар от потребител
    Given Отваря страницата за писане на коментар
    When Въведе валидно име на тема
    And въведе съдържание на коментара
    And и натисне бутона за създаване на коментар
    Then Вижда съобщение за успешено създаване на коментар

    Scenario: Създаване на коментар от потребител без съдържание
    Given Отваря страницата за писане на коментар
    When Въведе валидно име на тема
    And и натисне бутона за създаване на коментар
    Then Вижда съобщение за липса на съдържание
    
   Scenario: Създаване на коментар от потребител в несъществуваща тема
    Given Отваря страницата за писане на коментар
    When Въведе невалидно име на тема
    And въведе съдържание на коментара
    And и натисне бутона за създаване на коментар
    Then Вижда съобщение за несъществуваща тема