
Feature: Вход в системата


  Scenario: Вход в системата с валидни потребителски данни
    Given Отваря страницата за вход в системата
    When Въведе валидно потребителско име
    And въведе валидна парола
    And и натисне бутона за вход
    Then Вижда съобщение за успешен вход в системата.
    
  Scenario: Вход в системата без парола
    Given Отваря страницата за вход в системата
    When Въведе валидно потребителско име
    And и натисне бутона за вход
    Then Вижда съобщение за липса на данни
    
  Scenario: Вход в системата без потребителско име
    Given Отваря страницата за вход в системата
    When въведе валидна парола
    And и натисне бутона за вход
    Then Вижда съобщение за липса на данни

	Scenario: Вход в системата без данни
    Given Отваря страницата за вход в системата
    When и натисне бутона за вход
    Then Вижда съобщение за липса на данни