
Feature: Създаване на теми


	Scenario: Създаване на тема от администратор
    Given В системата влизаме с администраторски профил
    And Отваряме страницата за създаване на теми
    When Въведе име на тема: "Коли"
    And натискаме бутона за създаване
    Then Вижда съобщение: "Успешно създадохте тема!"
    
    
	Scenario: Създаване на тема от администратор без въвеждане на име
    Given В системата влизаме с администраторски профил
    And Отваряме страницата за създаване на теми
    And натискаме бутона за създаване
    Then Вижда съобщение: "Въведете име на тема!"
    
    
   Scenario: Създаване на тема от обикновен потребител
    Given В системата влизаме с обикновен профил
    And Отваряме страницата за създаване на теми
    When Въведе име на тема: "Коли"
    And натискаме бутона за създаване
    Then Вижда съобщение: "Нямате права да създавате тема!"